tap "derailed/k9s"
tap "sst/tap"
tap "withgraphite/tap"
brew "bat"
brew "btop"
brew "coreutils"
brew "docker"
brew "entr"
brew "eza"
brew "fzf"
brew "gh"
brew "git-absorb"
brew "tmux"
brew "gitmux"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "mosquitto"
brew "neovim"
brew "pyenv"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "weechat"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"
brew "sst/tap/opencode"
brew "withgraphite/tap/graphite"
cask "alfred"
cask "codex"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "iterm2"
cask "mockoon"
cask "notion"
cask "postman"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
vscode "alanz.vscode-hie-server"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "jakeboone02.pgn"
vscode "james-yu.latex-workshop"
vscode "jnoortheen.nix-ide"
vscode "justusadam.language-haskell"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "koprodev.theme-devpro-hc"
vscode "mame.ruby-typeprof"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "openai.chatgpt"
vscode "pflannery.vscode-versionlens"
vscode "pnp.polacode"
vscode "pomber.git-file-history"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "robertz.code-snapshot"
vscode "ryanolsonx.solarized"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.theme-check-vscode"
vscode "sorbet.sorbet-vscode-extension"
vscode "stardog-union.stardog-rdf-grammars"
vscode "styled-components.vscode-styled-components"
vscode "tomphilbin.gruvbox-themes"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wesbos.theme-cobalt2"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
go "github.com/deepmap/oapi-codegen/cmd/oapi-codegen"
go "honnef.co/go/tools/cmd/staticcheck"
